Revit 2027 API
RoomTag.TaggedLocalRoomId Property
The ElementId of the tagged room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TaggedLocalRoomId { get; }
Public ReadOnly Property TaggedLocalRoomId As ElementId
	Get
public:
property ElementId^ TaggedLocalRoomId {
	ElementId^ get ();
}
member TaggedLocalRoomId : ElementId with get
Property Value
ElementId
Remarks
If there is no tagged room so the RoomTag is orphaned, ElementId will be InvalidElementId.
See Also
Reference
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace